name = input("Введите ваше имя! ")
print("Приветсвую,", name, "!")
print("Ты попал в обьясниние сленга!")
print()
print()
print("-----------------------------------------------------")



memedict = {'ЛОЛ' : "ЛОЛ - Очень смешная шутка,или что-то",
            "КРИНЖ" : "КРИНЖ - Что-то очень странное, стыдное",
            "РОФЛ" : "РОФЛ - Шутка.",
            "ЩИЩ" : "ЩИЩ - Одобрение, восторг!",
            "КРИПОВЫЙ" : "КРИПОВЫЙ - Странный или пугающий",
            "АГРИТЬСЯ" : "АГРИТЬСЯ - Злится, и так далее"
            }
word = input("Введите непонятное для вас слово(Ввод только большими буквами)")

if word in memedict.keys():
    print(memedict[word])
else:
    print("Такого слова у меня нету(")
